import React from 'react';
import styles from './CertaintyFeatures.module.scss';

export const CertaintyFeatures = () => {
  const features = [
    {
      id: 1,
      title: '明确的需求边界',
      icon: (
        <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M0 3.33333C0 1.49238 1.49238 0 3.33333 0H11.6667C13.5076 0 15 1.49238 15 3.33333V26.6667C15 28.5076 13.5076 30 11.6667 30H3.33333C1.49238 30 0 28.5076 0 26.6667V3.33333ZM10 22.5C10 23.8807 8.88071 25 7.5 25C6.11929 25 5 23.8807 5 22.5C5 21.1193 6.11929 20 7.5 20C8.88071 20 10 21.1193 10 22.5Z" fill="white" />
          <path d="M16.6667 30H26.6667C28.5076 30 30 28.5076 30 26.6667V18.3333C30 16.8775 29.0667 15.6397 27.7659 15.1855L16.6667 26.2847L16.6667 30Z" fill="white" />
          <path d="M28.4954 12.099C29.6322 10.7895 29.578 8.80438 28.3329 7.55927L22.4403 1.66671C21.1386 0.364969 19.028 0.364964 17.7263 1.66671L16.6667 2.72634V23.9277L28.4954 12.099Z" fill="white" />
        </svg>
      )

    },
    {
      id: 2,
      title: '透明的开发过程',
      icon: (
        <svg width="40" height="24" viewBox="0 0 40 24" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M29.6071 3.3663L38.3551 10.1835C38.9207 10.625 39.25 11.2934 39.25 12C39.25 12.7066 38.9207 13.375 38.3551 13.8165L29.6071 20.6337C23.8415 25.1221 15.6585 25.1221 9.89286 20.6337L1.14491 13.8165C0.579253 13.375 0.25 12.7066 0.25 12C0.25 11.2934 0.579253 10.625 1.14491 10.1835L9.89286 3.3663C15.6585 -1.1221 23.8415 -1.1221 29.6071 3.3663ZM14.9365 12C14.9365 14.5927 17.0916 16.6944 19.75 16.6944C22.4084 16.6944 24.5635 14.5927 24.5635 12C24.5635 9.40733 22.4084 7.30556 19.75 7.30556C17.0916 7.30556 14.9365 9.40733 14.9365 12Z" fill="white" />
        </svg>

      )
    },
    {
      id: 3,
      title: '准时的交付周期',
      icon: (
        <svg width="34" height="34" viewBox="0 0 34 34" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M16.9997 0.333984C7.79493 0.333984 0.333008 7.79591 0.333008 17.0007C0.333008 26.2054 7.79493 33.6673 16.9997 33.6673C26.2044 33.6673 33.6663 26.2054 33.6663 17.0007C33.6663 7.79591 26.2044 0.333984 16.9997 0.333984ZM18.6663 8.66732C18.6663 7.74684 17.9201 7.00065 16.9997 7.00065C16.0792 7.00065 15.333 7.74684 15.333 8.66732V17.0007C15.333 17.4427 15.5086 17.8666 15.8212 18.1792L20.8212 23.1792C21.472 23.83 22.5273 23.83 23.1782 23.1792C23.8291 22.5283 23.8291 21.473 23.1782 20.8221L18.6663 16.3103V8.66732Z" fill="white" />
        </svg>

      )
    },
    {
      id: 4,
      title: '可靠的系统质量',
      icon: (
        <svg width="36" height="32" viewBox="0 0 36 32" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M8.96676 0C7.77057 0 6.66609 0.640953 6.07261 1.67954L0.517394 11.4012C-0.228387 12.7063 -0.00838806 14.3491 1.05451 15.412L16.5264 30.8839C17.34 31.6975 18.6591 31.6975 19.4727 30.8839L34.9446 15.412C36.0075 14.3491 36.2275 12.7063 35.4817 11.4012L29.9265 1.67954C29.333 0.640954 28.2285 0 27.0323 0H8.96676ZM12.5114 10.4882C11.8605 9.83728 10.8053 9.83728 10.1544 10.4882C9.50352 11.139 9.50352 12.1943 10.1544 12.8452L16.5264 19.2172C17.34 20.0308 18.6591 20.0308 19.4727 19.2172L25.8447 12.8452C26.4956 12.1943 26.4956 11.139 25.8447 10.4882C25.1939 9.83728 24.1386 9.83728 23.4877 10.4882L17.9996 15.9763L12.5114 10.4882Z" fill="white" />
        </svg>
      )

    },
    {
      id: 5,
      title: '负责到底的态度',
      icon: (
        <svg width="35" height="36" viewBox="0 0 35 36" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" clip-rule="evenodd" d="M13.9431 0C16.4631 0 18.2079 1.57307 19.324 3.78976C20.2951 5.71848 20.3868 8.03551 20.4339 10.1538H29.4224C32.6853 10.1538 35.2513 12.9232 34.9804 16.1522L34.3092 24.1501C33.7471 30.8481 28.1088 36 21.3407 36H18.5289C15.0812 36 11.863 34.6572 9.52492 32.3993C9.2623 32.1457 8.89002 32.0389 8.53189 32.11C7.87674 32.2399 7.19943 32.3079 6.50674 32.3079C4.44649 32.3079 2.73577 31.1614 1.62847 29.3385C0.551951 27.5663 0 25.1198 0 22.1541C0 19.1883 0.551951 16.7418 1.62847 14.9696C2.73577 13.1468 4.44649 12.0002 6.50674 12.0002C7.03006 12.0002 7.58247 12.0916 8.13773 12.2466C8.98828 10.0327 9.59486 7.7489 9.30812 5.35245C8.98891 2.68469 11.1832 0 13.9431 0Z" fill="white" />
        </svg>

      )
    }
  ];

  return (
    <section className={styles.certaintyFeatures}>
      <div className={styles.container}>
        <div className={styles.content}>
          <div className={styles.textContent}>
            <h2 className={styles.title}>在软件定制领域，我们只出品一样东西：<span style={{ color: '#6334EA' }}>确定性</span></h2>
            <p className={styles.description}>
              我们深知，复杂的系统开发，最大的风险在于过程的不可控。因此，我们将"确定性"作为交付的核心，它体现在每一个合作细节中：
            </p>
          </div>

          <div className={styles.featuresGrid}>
            {features.map((feature) => (
              <div key={feature.id} className={styles.featureCard}>
                <div className={styles.iconWrapper}>
                  <div className={styles.iconBg}>
                    {feature.icon}
                    {/* <div className={styles.icon} data-icon={feature.icon}></div> */}
                  </div>
                </div>
                <h3 className={styles.featureTitle}>{feature.title}</h3>
              </div>
            ))}
          </div>
        </div>
      </div>
    </section>
  );
};
